Lelouch2503/stm32f411xe/inc/stm32f411_xe.h
/**
 * @file    stm32f411_xe.h
 * @brief   STM32F411xE device-level register definitions (bare-metal)
 *
 * Provides:
 *  - IO access qualifiers (__IO, __I, __O)
 *  - Memory-map base addresses
 *  - Peripheral register structures (RCC, FLASH, PWR)
 *  - Bit-field position/mask macros for all RCC-related registers
 *
 * Reference: RM0383 Rev 3 — STM32F411xC/E Reference Manual
 */

#ifndef STM32F411_XE_H
#define STM32F411_XE_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

/* ══════════════════════════════════════════════════════════════════════
 * IO Access Qualifiers
 * ═════════════════════════════════════════════════════════════════════ */
#define __IO volatile      /**< Read / Write access            */
#define __I volatile const /**< Read-only access               */
#define __O volatile       /**< Write-only access              */

/* ══════════════════════════════════════════════════════════════════════
 * Clock Source Default Values
 * ═════════════════════════════════════════════════════════════════════ */
#ifndef HSE_VALUE
#define HSE_VALUE 8000000U /**< External crystal: 8 MHz (Discovery board) */
#endif

#ifndef HSI_VALUE
#define HSI_VALUE 16000000U /**< Internal RC oscillator: 16 MHz */
#endif

/* ══════════════════════════════════════════════════════════════════════
 * Memory Map — Base Addresses
 * ═════════════════════════════════════════════════════════════════════ */
#define PERIPH_BASE 0x40000000UL

#define APB1PERIPH_BASE (PERIPH_BASE)
#define APB2PERIPH_BASE (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x10000000UL)

/* ── Peripheral Base Addresses ─────────────────────────────────────── */
#define PWR_BASE    (APB1PERIPH_BASE + 0x7000UL)
#define RCC_BASE    (AHB1PERIPH_BASE + 0x3800UL)
#define FLASH_R_BASE (AHB1PERIPH_BASE + 0x3C00UL)

/* USART base addresses (RM0383 §2.3, Table 1) */
#define USART2_BASE (APB1PERIPH_BASE + 0x4400UL) /**< APB1 */
#define USART1_BASE (APB2PERIPH_BASE + 0x1000UL) /**< APB2 */
#define USART6_BASE (APB2PERIPH_BASE + 0x1400UL) /**< APB2 */

/* I2C base addresses (RM0383 §2.3, Table 1) */
#define I2C1_BASE (APB1PERIPH_BASE + 0x5400UL) /**< APB1 */
#define I2C2_BASE (APB1PERIPH_BASE + 0x5800UL) /**< APB1 */
#define I2C3_BASE (APB1PERIPH_BASE + 0x5C00UL) /**< APB1 */

/* GPIO base addresses */
#define GPIOA_BASE  (AHB1PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE  (AHB1PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE  (AHB1PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE  (AHB1PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE  (AHB1PERIPH_BASE + 0x1000UL)
#define GPIOH_BASE  (AHB1PERIPH_BASE + 0x1C00UL)

/* ══════════════════════════════════════════════════════════════════════
 * Peripheral Register Structures
 * ═════════════════════════════════════════════════════════════════════ */

/* ── RCC (Reset and Clock Control) ─────────────────────────────────── */
typedef struct {
  union {
    __IO uint32_t reg;         /**< 0x00 Clock control register */
    struct {
      __IO uint32_t HSION      : 1;  /**< [0] Internal high-speed clock enable */
      __I  uint32_t HSIRDY     : 1;  /**< [1] Internal high-speed clock ready flag */
      uint32_t                 : 1;  /**< [2] Reserved */
      __IO uint32_t HSITRIM    : 5;  /**< [7:3] Internal high-speed clock trimming */
      __I  uint32_t HSICAL     : 8;  /**< [15:8] Internal high-speed clock calibration */
      __IO uint32_t HSEON      : 1;  /**< [16] External high-speed clock enable */
      __I  uint32_t HSERDY     : 1;  /**< [17] External high-speed clock ready flag */
      __IO uint32_t HSEBYP     : 1;  /**< [18] External high-speed clock bypass */
      __IO uint32_t CSSON      : 1;  /**< [19] Clock security system enable */
      uint32_t                 : 4;  /**< [23:20] Reserved */
      __IO uint32_t PLLON      : 1;  /**< [24] Main PLL enable */
      __I  uint32_t PLLRDY     : 1;  /**< [25] Main PLL clock ready flag */
      __IO uint32_t PLLI2SON   : 1;  /**< [26] PLLI2S enable */
      __I  uint32_t PLLI2SRDY  : 1;  /**< [27] PLLI2S clock ready flag */
      uint32_t                 : 4;  /**< [31:28] Reserved */
    } bit;
  } CR;

  union {
    __IO uint32_t reg;    /**< 0x04 PLL configuration register */
    struct {
      __IO uint32_t PLLM       : 6;  /**< [5:0] Division factor for the main PLL and PLLI2S input clock */
      __IO uint32_t PLLN       : 9;  /**< [14:6] Main PLL VCO multiplier */
      uint32_t                 : 1;  /**< [15] Reserved */
      __IO uint32_t PLLP       : 2;  /**< [17:16] Main PLL division factor for main system clock */
      uint32_t                 : 4;  /**< [21:18] Reserved */
      __IO uint32_t PLLSRC     : 1;  /**< [22] Main PLL and PLLI2S entry clock source (0=HSI, 1=HSE) */
      uint32_t                 : 1;  /**< [23] Reserved */
      __IO uint32_t PLLQ       : 4;  /**< [27:24] Main PLL division factor for USB OTG FS, SDIO, etc. */
      uint32_t                 : 4;  /**< [31:28] Reserved */
    } bit;
  } PLLCFGR;

  union {
    __IO uint32_t reg;       /**< 0x08 Clock configuration register */
    struct {
      __IO uint32_t SW         : 2;  /**< [1:0] System clock switch */
      __I  uint32_t SWS        : 2;  /**< [3:2] System clock switch status */
      __IO uint32_t HPRE       : 4;  /**< [7:4] AHB prescaler */
      uint32_t                 : 2;  /**< [9:8] Reserved */
      __IO uint32_t PPRE1      : 3;  /**< [12:10] APB Low speed prescaler (APB1) */
      __IO uint32_t PPRE2      : 3;  /**< [15:13] APB High speed prescaler (APB2) */
      __IO uint32_t RTCPRE     : 5;  /**< [20:16] HSE division factor for RTC clock */
      __IO uint32_t MCO1       : 2;  /**< [22:21] Microcontroller clock output 1 */
      __IO uint32_t I2SSRC     : 1;  /**< [23] I2S clock source selection */
      __IO uint32_t MCO1PRE    : 3;  /**< [26:24] MCO1 prescaler */
      __IO uint32_t MCO2PRE    : 3;  /**< [29:27] MCO2 prescaler */
      __IO uint32_t MCO2       : 2;  /**< [31:30] Microcontroller clock output 2 */
    } bit;
  } CFGR;

  union {
    __IO uint32_t reg;        /**< 0x0C Clock interrupt register */
    struct {
      __I  uint32_t LSIRDYF    : 1;  /**< [0] LSI ready interrupt flag */
      __I  uint32_t LSERDYF    : 1;  /**< [1] LSE ready interrupt flag */
      __I  uint32_t HSIRDYF    : 1;  /**< [2] HSI ready interrupt flag */
      __I  uint32_t HSERDYF    : 1;  /**< [3] HSE ready interrupt flag */
      __I  uint32_t PLLRDYF    : 1;  /**< [4] PLL ready interrupt flag */
      __I  uint32_t PLLI2SRDYF : 1;  /**< [5] PLLI2S ready interrupt flag */
      uint32_t                 : 1;  /**< [6] Reserved */
      __I  uint32_t CSSF       : 1;  /**< [7] Clock security system interrupt flag */
      __IO uint32_t LSIRDYIE   : 1;  /**< [8] LSI ready interrupt enable */
      __IO uint32_t LSERDYIE   : 1;  /**< [9] LSE ready interrupt enable */
      __IO uint32_t HSIRDYIE   : 1;  /**< [10] HSI ready interrupt enable */
      __IO uint32_t HSERDYIE   : 1;  /**< [11] HSE ready interrupt enable */
      __IO uint32_t PLLRDYIE   : 1;  /**< [12] PLL ready interrupt enable */
      __IO uint32_t PLLI2SRDYIE: 1;  /**< [13] PLLI2S ready interrupt enable */
      uint32_t                 : 2;  /**< [15:14] Reserved */
      __O  uint32_t LSIRDYC    : 1;  /**< [16] LSI ready interrupt clear */
      __O  uint32_t LSERDYC    : 1;  /**< [17] LSE ready interrupt clear */
      __O  uint32_t HSIRDYC    : 1;  /**< [18] HSI ready interrupt clear */
      __O  uint32_t HSERDYC    : 1;  /**< [19] HSE ready interrupt clear */
      __O  uint32_t PLLRDYC    : 1;  /**< [20] PLL ready interrupt clear */
      __O  uint32_t PLLI2SRDYC : 1;  /**< [21] PLLI2S ready interrupt clear */
      uint32_t                 : 1;  /**< [22] Reserved */
      __O  uint32_t CSSC       : 1;  /**< [23] Clock security system interrupt clear */
      uint32_t                 : 8;  /**< [31:24] Reserved */
    } bit;
  } CIR;

  union {
    __IO uint32_t reg;   /**< 0x10 AHB1 peripheral reset register */
    struct {
      __IO uint32_t GPIOARST   : 1;  /**< [0] GPIOA reset */
      __IO uint32_t GPIOBRST   : 1;  /**< [1] GPIOB reset */
      __IO uint32_t GPIOCRST   : 1;  /**< [2] GPIOC reset */
      __IO uint32_t GPIODRST   : 1;  /**< [3] GPIOD reset */
      __IO uint32_t GPIOERST   : 1;  /**< [4] GPIOE reset */
      uint32_t                 : 2;  /**< [6:5] Reserved */
      __IO uint32_t GPIOHRST   : 1;  /**< [7] GPIOH reset */
      uint32_t                 : 4;  /**< [11:8] Reserved */
      __IO uint32_t CRCRST     : 1;  /**< [12] CRC reset */
      uint32_t                 : 8;  /**< [20:13] Reserved */
      __IO uint32_t DMA1RST    : 1;  /**< [21] DMA1 reset */
      __IO uint32_t DMA2RST    : 1;  /**< [22] DMA2 reset */
      uint32_t                 : 9;  /**< [31:23] Reserved */
    } bit;
  } AHB1RSTR;

  union {
    __IO uint32_t reg;   /**< 0x14 AHB2 peripheral reset register */
    struct {
      uint32_t                 : 7;  /**< [6:0] Reserved */
      __IO uint32_t OTGFSRST   : 1;  /**< [7] USB OTG FS reset */
      uint32_t                 : 24; /**< [31:8] Reserved */
    } bit;
  } AHB2RSTR;

  uint32_t RESERVED0[2];    /**< 0x18–0x1C Reserved */

  union {
    __IO uint32_t reg;   /**< 0x20 APB1 peripheral reset register */
    struct {
      __IO uint32_t TIM2RST    : 1;  /**< [0] TIM2 reset */
      __IO uint32_t TIM3RST    : 1;  /**< [1] TIM3 reset */
      __IO uint32_t TIM4RST    : 1;  /**< [2] TIM4 reset */
      __IO uint32_t TIM5RST    : 1;  /**< [3] TIM5 reset */
      uint32_t                 : 7;  /**< [10:4] Reserved */
      __IO uint32_t WWDGRST    : 1;  /**< [11] Window watchdog reset */
      uint32_t                 : 2;  /**< [13:12] Reserved */
      __IO uint32_t SPI2RST    : 1;  /**< [14] SPI2 reset */
      __IO uint32_t SPI3RST    : 1;  /**< [15] SPI3 reset */
      uint32_t                 : 1;  /**< [16] Reserved */
      __IO uint32_t USART2RST  : 1;  /**< [17] USART2 reset */
      uint32_t                 : 3;  /**< [20:18] Reserved */
      __IO uint32_t I2C1RST    : 1;  /**< [21] I2C1 reset */
      __IO uint32_t I2C2RST    : 1;  /**< [22] I2C2 reset */
      __IO uint32_t I2C3RST    : 1;  /**< [23] I2C3 reset */
      uint32_t                 : 4;  /**< [27:24] Reserved */
      __IO uint32_t PWRRST     : 1;  /**< [28] Power interface reset */
      uint32_t                 : 3;  /**< [31:29] Reserved */
    } bit;
  } APB1RSTR;

  union {
    __IO uint32_t reg;   /**< 0x24 APB2 peripheral reset register */
    struct {
      __IO uint32_t TIM1RST    : 1;  /**< [0] TIM1 reset */
      uint32_t                 : 3;  /**< [3:1] Reserved */
      __IO uint32_t USART1RST  : 1;  /**< [4] USART1 reset */
      __IO uint32_t USART6RST  : 1;  /**< [5] USART6 reset */
      uint32_t                 : 2;  /**< [7:6] Reserved */
      __IO uint32_t ADC1RST    : 1;  /**< [8] ADC1 reset */
      uint32_t                 : 2;  /**< [10:9] Reserved */
      __IO uint32_t SDIORST    : 1;  /**< [11] SDIO reset */
      __IO uint32_t SPI1RST    : 1;  /**< [12] SPI1 reset */
      __IO uint32_t SPI4RST    : 1;  /**< [13] SPI4 reset */
      __IO uint32_t SYSCFGRST  : 1;  /**< [14] System configuration controller reset */
      uint32_t                 : 1;  /**< [15] Reserved */
      __IO uint32_t TIM9RST    : 1;  /**< [16] TIM9 reset */
      __IO uint32_t TIM10RST   : 1;  /**< [17] TIM10 reset */
      __IO uint32_t TIM11RST   : 1;  /**< [18] TIM11 reset */
      uint32_t                 : 1;  /**< [19] Reserved */
      __IO uint32_t SPI5RST    : 1;  /**< [20] SPI5 reset */
      uint32_t                 : 11; /**< [31:21] Reserved */
    } bit;
  } APB2RSTR;

