Lelouch2503/stm32f411xe/inc/stm32f411_xe.h
  uint32_t RESERVED1[2];    /**< 0x28–0x2C Reserved */

  union {
    __IO uint32_t reg;    /**< 0x30 AHB1 peripheral clock enable register */
    struct {
      __IO uint32_t GPIOAEN    : 1;  /**< [0] GPIOA clock enable */
      __IO uint32_t GPIOBEN    : 1;  /**< [1] GPIOB clock enable */
      __IO uint32_t GPIOCEN    : 1;  /**< [2] GPIOC clock enable */
      __IO uint32_t GPIODEN    : 1;  /**< [3] GPIOD clock enable */
      __IO uint32_t GPIOEEN    : 1;  /**< [4] GPIOE clock enable */
      uint32_t                 : 2;  /**< [6:5] Reserved */
      __IO uint32_t GPIOHEN    : 1;  /**< [7] GPIOH clock enable */
      uint32_t                 : 4;  /**< [11:8] Reserved */
      __IO uint32_t CRCEN      : 1;  /**< [12] CRC clock enable */
      uint32_t                 : 8;  /**< [20:13] Reserved */
      __IO uint32_t DMA1EN     : 1;  /**< [21] DMA1 clock enable */
      __IO uint32_t DMA2EN     : 1;  /**< [22] DMA2 clock enable */
      uint32_t                 : 9;  /**< [31:23] Reserved */
    } bit;
  } AHB1ENR;

  union {
    __IO uint32_t reg;    /**< 0x34 AHB2 peripheral clock enable register */
    struct {
      uint32_t                 : 7;  /**< [6:0] Reserved */
      __IO uint32_t OTGFSEN    : 1;  /**< [7] USB OTG FS clock enable */
      uint32_t                 : 24; /**< [31:8] Reserved */
    } bit;
  } AHB2ENR;

  uint32_t RESERVED2[2];    /**< 0x38–0x3C Reserved */

  union {
    __IO uint32_t reg;    /**< 0x40 APB1 peripheral clock enable register */
    struct {
      __IO uint32_t TIM2EN     : 1;  /**< [0] TIM2 clock enable */
      __IO uint32_t TIM3EN     : 1;  /**< [1] TIM3 clock enable */
      __IO uint32_t TIM4EN     : 1;  /**< [2] TIM4 clock enable */
      __IO uint32_t TIM5EN     : 1;  /**< [3] TIM5 clock enable */
      uint32_t                 : 7;  /**< [10:4] Reserved */
      __IO uint32_t WWDGEN     : 1;  /**< [11] Window watchdog clock enable */
      uint32_t                 : 2;  /**< [13:12] Reserved */
      __IO uint32_t SPI2EN     : 1;  /**< [14] SPI2 clock enable */
      __IO uint32_t SPI3EN     : 1;  /**< [15] SPI3 clock enable */
      uint32_t                 : 1;  /**< [16] Reserved */
      __IO uint32_t USART2EN   : 1;  /**< [17] USART2 clock enable */
      uint32_t                 : 3;  /**< [20:18] Reserved */
      __IO uint32_t I2C1EN     : 1;  /**< [21] I2C1 clock enable */
      __IO uint32_t I2C2EN     : 1;  /**< [22] I2C2 clock enable */
      __IO uint32_t I2C3EN     : 1;  /**< [23] I2C3 clock enable */
      uint32_t                 : 4;  /**< [27:24] Reserved */
      __IO uint32_t PWREN      : 1;  /**< [28] Power interface clock enable */
      uint32_t                 : 3;  /**< [31:29] Reserved */
    } bit;
  } APB1ENR;

  union {
    __IO uint32_t reg;    /**< 0x44 APB2 peripheral clock enable register */
    struct {
      __IO uint32_t TIM1EN     : 1;  /**< [0] TIM1 clock enable */
      uint32_t                 : 3;  /**< [3:1] Reserved */
      __IO uint32_t USART1EN   : 1;  /**< [4] USART1 clock enable */
      __IO uint32_t USART6EN   : 1;  /**< [5] USART6 clock enable */
      uint32_t                 : 2;  /**< [7:6] Reserved */
      __IO uint32_t ADC1EN     : 1;  /**< [8] ADC1 clock enable */
      uint32_t                 : 2;  /**< [10:9] Reserved */
      __IO uint32_t SDIOEN     : 1;  /**< [11] SDIO clock enable */
      __IO uint32_t SPI1EN     : 1;  /**< [12] SPI1 clock enable */
      __IO uint32_t SPI4EN     : 1;  /**< [13] SPI4 clock enable */
      __IO uint32_t SYSCFGEN   : 1;  /**< [14] System configuration controller clock enable */
      uint32_t                 : 1;  /**< [15] Reserved */
      __IO uint32_t TIM9EN     : 1;  /**< [16] TIM9 clock enable */
      __IO uint32_t TIM10EN    : 1;  /**< [17] TIM10 clock enable */
      __IO uint32_t TIM11EN    : 1;  /**< [18] TIM11 clock enable */
      uint32_t                 : 1;  /**< [19] Reserved */
      __IO uint32_t SPI5EN     : 1;  /**< [20] SPI5 clock enable */
      uint32_t                 : 11; /**< [31:21] Reserved */
    } bit;
  } APB2ENR;

  uint32_t RESERVED3[2];    /**< 0x48–0x4C Reserved */

  union {
    __IO uint32_t reg;  /**< 0x50 AHB1 clock enable in low-power register */
    struct {
      __IO uint32_t GPIOALPEN  : 1;  /**< [0] GPIOA clock enable in low-power */
      __IO uint32_t GPIOBLPEN  : 1;  /**< [1] GPIOB clock enable in low-power */
      __IO uint32_t GPIOCLPEN  : 1;  /**< [2] GPIOC clock enable in low-power */
      __IO uint32_t GPIODLPEN  : 1;  /**< [3] GPIOD clock enable in low-power */
      __IO uint32_t GPIOELPEN  : 1;  /**< [4] GPIOE clock enable in low-power */
      uint32_t                 : 2;  /**< [6:5] Reserved */
      __IO uint32_t GPIOHLPEN  : 1;  /**< [7] GPIOH clock enable in low-power */
      uint32_t                 : 4;  /**< [11:8] Reserved */
      __IO uint32_t CRCLPEN    : 1;  /**< [12] CRC clock enable in low-power */
      uint32_t                 : 2;  /**< [14:13] Reserved */
      __IO uint32_t FLASHLPEN  : 1;  /**< [15] Flash interface clock enable in low-power */
      __IO uint32_t SRAM1LPEN  : 1;  /**< [16] SRAM1 clock enable in low-power */
      uint32_t                 : 4;  /**< [20:17] Reserved */
      __IO uint32_t DMA1LPEN   : 1;  /**< [21] DMA1 clock enable in low-power */
      __IO uint32_t DMA2LPEN   : 1;  /**< [22] DMA2 clock enable in low-power */
      uint32_t                 : 9;  /**< [31:23] Reserved */
    } bit;
  } AHB1LPENR;

  union {
    __IO uint32_t reg;  /**< 0x54 AHB2 clock enable in low-power register */
    struct {
      uint32_t                 : 7;  /**< [6:0] Reserved */
      __IO uint32_t OTGFSLPEN  : 1;  /**< [7] USB OTG FS clock enable in low-power */
      uint32_t                 : 24; /**< [31:8] Reserved */
    } bit;
  } AHB2LPENR;

  uint32_t RESERVED4[2];    /**< 0x58–0x5C Reserved */

  union {
    __IO uint32_t reg;  /**< 0x60 APB1 clock enable in low-power register */
    struct {
      __IO uint32_t TIM2LPEN   : 1;  /**< [0] TIM2 clock enable in low-power */
      __IO uint32_t TIM3LPEN   : 1;  /**< [1] TIM3 clock enable in low-power */
      __IO uint32_t TIM4LPEN   : 1;  /**< [2] TIM4 clock enable in low-power */
      __IO uint32_t TIM5LPEN   : 1;  /**< [3] TIM5 clock enable in low-power */
      uint32_t                 : 7;  /**< [10:4] Reserved */
      __IO uint32_t WWDGLPEN   : 1;  /**< [11] Window watchdog clock enable in low-power */
      uint32_t                 : 2;  /**< [13:12] Reserved */
      __IO uint32_t SPI2LPEN   : 1;  /**< [14] SPI2 clock enable in low-power */
      __IO uint32_t SPI3LPEN   : 1;  /**< [15] SPI3 clock enable in low-power */
      uint32_t                 : 1;  /**< [16] Reserved */
      __IO uint32_t USART2LPEN : 1;  /**< [17] USART2 clock enable in low-power */
      uint32_t                 : 3;  /**< [20:18] Reserved */
      __IO uint32_t I2C1LPEN   : 1;  /**< [21] I2C1 clock enable in low-power */
      __IO uint32_t I2C2LPEN   : 1;  /**< [22] I2C2 clock enable in low-power */
      __IO uint32_t I2C3LPEN   : 1;  /**< [23] I2C3 clock enable in low-power */
      uint32_t                 : 4;  /**< [27:24] Reserved */
      __IO uint32_t PWRLPEN    : 1;  /**< [28] Power interface clock enable in low-power */
      uint32_t                 : 3;  /**< [31:29] Reserved */
    } bit;
  } APB1LPENR;

  union {
    __IO uint32_t reg;  /**< 0x64 APB2 clock enable in low-power register */
    struct {
      __IO uint32_t TIM1LPEN   : 1;  /**< [0] TIM1 clock enable in low-power */
      uint32_t                 : 3;  /**< [3:1] Reserved */
      __IO uint32_t USART1LPEN : 1;  /**< [4] USART1 clock enable in low-power */
      __IO uint32_t USART6LPEN : 1;  /**< [5] USART6 clock enable in low-power */
      uint32_t                 : 2;  /**< [7:6] Reserved */
      __IO uint32_t ADC1LPEN   : 1;  /**< [8] ADC1 clock enable in low-power */
      uint32_t                 : 2;  /**< [10:9] Reserved */
      __IO uint32_t SDIOLPEN   : 1;  /**< [11] SDIO clock enable in low-power */
      __IO uint32_t SPI1LPEN   : 1;  /**< [12] SPI1 clock enable in low-power */
      __IO uint32_t SPI4LPEN   : 1;  /**< [13] SPI4 clock enable in low-power */
      __IO uint32_t SYSCFGLPEN : 1;  /**< [14] System configuration controller clock enable in low-power */
      uint32_t                 : 1;  /**< [15] Reserved */
      __IO uint32_t TIM9LPEN   : 1;  /**< [16] TIM9 clock enable in low-power */
      __IO uint32_t TIM10LPEN  : 1;  /**< [17] TIM10 clock enable in low-power */
      __IO uint32_t TIM11LPEN  : 1;  /**< [18] TIM11 clock enable in low-power */
      uint32_t                 : 1;  /**< [19] Reserved */
      __IO uint32_t SPI5LPEN   : 1;  /**< [20] SPI5 clock enable in low-power */
      uint32_t                 : 11; /**< [31:21] Reserved */
    } bit;
  } APB2LPENR;

  uint32_t RESERVED5[2];    /**< 0x68–0x6C Reserved */

  union {
    __IO uint32_t reg;       /**< 0x70 Backup domain control register */
    struct {
      __IO uint32_t LSEON      : 1;  /**< [0] External low-speed oscillator enable */
      __I  uint32_t LSERDY     : 1;  /**< [1] External low-speed oscillator ready */
      __IO uint32_t LSEBYP     : 1;  /**< [2] External low-speed oscillator bypass */
      uint32_t                 : 5;  /**< [7:3] Reserved */
      __IO uint32_t RTCSEL     : 2;  /**< [9:8] RTC clock source selection */
      uint32_t                 : 5;  /**< [14:10] Reserved */
      __IO uint32_t RTCEN      : 1;  /**< [15] RTC clock enable */
      __IO uint32_t BDRST      : 1;  /**< [16] Backup domain software reset */
      uint32_t                 : 15; /**< [31:17] Reserved */
    } bit;
  } BDCR;

  union {
    __IO uint32_t reg;        /**< 0x74 Clock control & status register */
    struct {
      __IO uint32_t LSION      : 1;  /**< [0] Internal low-speed oscillator enable */
      __I  uint32_t LSIRDY     : 1;  /**< [1] Internal low-speed oscillator ready */
      uint32_t                 : 22; /**< [23:2] Reserved */
      __IO uint32_t RMVF       : 1;  /**< [24] Remove reset flag */
      __IO uint32_t BORRSTF    : 1;  /**< [25] BOR reset flag */
      __IO uint32_t PINRSTF    : 1;  /**< [26] PIN reset flag */
      __IO uint32_t PORRSTF    : 1;  /**< [27] POR/PDR reset flag */
      __IO uint32_t SFTRSTF    : 1;  /**< [28] Software reset flag */
      __IO uint32_t IWDGRSTF   : 1;  /**< [29] Independent watchdog reset flag */
      __IO uint32_t WWDGRSTF   : 1;  /**< [30] Window watchdog reset flag */
      __IO uint32_t LPWRRSTF   : 1;  /**< [31] Low-power reset flag */
    } bit;
  } CSR;

  uint32_t RESERVED6[2];    /**< 0x78–0x7C Reserved */

  union {
    __IO uint32_t reg;      /**< 0x80 Spread spectrum clock generation register */
    struct {
      __IO uint32_t MODPER     : 13; /**< [12:0] Modulation period */
      __IO uint32_t INCSTEP    : 12; /**< [24:13] Incremental step */
      uint32_t                 : 5;  /**< [29:25] Reserved */
      __IO uint32_t SPREADSEL  : 1;  /**< [30] Spread Select */
      __IO uint32_t SSCGEN     : 1;  /**< [31] Spread spectrum modulation enable */
    } bit;
  } SSCGR;

  union {
    __IO uint32_t reg; /**< 0x84 PLLI2S configuration register */
    struct {
      uint32_t                 : 6;  /**< [5:0] Reserved */
      __IO uint32_t PLLI2SN    : 9;  /**< [14:6] PLLI2S VCO multiplier */
      uint32_t                 : 13; /**< [27:15] Reserved */
      __IO uint32_t PLLI2SR    : 3;  /**< [30:28] PLLI2S division factor for I2S clock */
      uint32_t                 : 1;  /**< [31] Reserved */
    } bit;
  } PLLI2SCFGR;

  uint32_t RESERVED7;       /**< 0x88 Reserved */

  union {
    __IO uint32_t reg;    /**< 0x8C Dedicated clocks configuration register */
    struct {
      uint32_t                 : 24; /**< [23:0] Reserved */
      __IO uint32_t CKOUTSRC   : 2;  /**< [25:24] MCO2/MCO1 output clock source selection */
      uint32_t                 : 6;  /**< [31:26] Reserved */
    } bit;
  } DCKCFGR;
} RCC_TypeDef;

/* ── FLASH Interface ───────────────────────────────────────────────── */
typedef struct {
  union {
    __IO uint32_t reg;     /**< 0x00  Access control          */
    struct {
      __IO uint32_t LATENCY  : 4;  /**< [3:0] Latency wait states */
      uint32_t               : 4;  /**< [7:4] Reserved */
      __IO uint32_t PRFTEN   : 1;  /**< [8] Prefetch enable */
      __IO uint32_t ICEN     : 1;  /**< [9] Instruction cache enable */
      __IO uint32_t DCEN     : 1;  /**< [10] Data cache enable */
      __IO uint32_t ICRST    : 1;  /**< [11] Instruction cache reset */
      __IO uint32_t DCRST    : 1;  /**< [12] Data cache reset */
      uint32_t               : 19; /**< [31:13] Reserved */
    } bit;
  } ACR;
  __IO uint32_t KEYR;    /**< 0x04  Key                     */
  __IO uint32_t OPTKEYR; /**< 0x08  Option key              */
  union {
    __IO uint32_t reg;      /**< 0x0C  Status                  */
    struct {
      __IO uint32_t EOP      : 1;  /**< [0] End of operation */
      __IO uint32_t OPERR    : 1;  /**< [1] Operation error */
      uint32_t               : 2;  /**< [3:2] Reserved */
      __IO uint32_t WRPERR   : 1;  /**< [4] Write protection error */
      __IO uint32_t PGAERR   : 1;  /**< [5] Programming alignment error */
      __IO uint32_t PGPERR   : 1;  /**< [6] Programming parallelism error */
      __IO uint32_t PGSERR   : 1;  /**< [7] Programming sequence error */
      uint32_t               : 8;  /**< [15:8] Reserved */
      __I  uint32_t BSY      : 1;  /**< [16] Busy */
      uint32_t               : 15; /**< [31:17] Reserved */
    } bit;
  } SR;
  union {
    __IO uint32_t reg;      /**< 0x10  Control                 */
    struct {
      __IO uint32_t PG       : 1;  /**< [0] Programming */
      __IO uint32_t SER      : 1;  /**< [1] Sector Erase */
      __IO uint32_t MER      : 1;  /**< [2] Mass Erase */
      __IO uint32_t SNB      : 4;  /**< [6:3] Sector number */
      uint32_t               : 1;  /**< [7] Reserved */
      __IO uint32_t PSIZE    : 2;  /**< [9:8] Program size */
      uint32_t               : 6;  /**< [15:10] Reserved */
      __IO uint32_t STRT     : 1;  /**< [16] Start */
      uint32_t               : 8;  /**< [24:17] Reserved */
      __IO uint32_t EOPIE    : 1;  /**< [25] End of operation interrupt enable */
      __IO uint32_t ERRIE    : 1;  /**< [26] Error interrupt enable */
      uint32_t               : 4;  /**< [30:27] Reserved */
      __IO uint32_t LOCK     : 1;  /**< [31] Lock */
    } bit;
  } CR;
  union {
    __IO uint32_t reg;   /**< 0x14  Option control          */
    struct {
      __IO uint32_t OPTLOCK  : 1;  /**< [0] Option lock */
      __IO uint32_t OPTSTRT  : 1;  /**< [1] Option start */
      __IO uint32_t BOR_LEV  : 2;  /**< [3:2] BOR level */
      uint32_t               : 1;  /**< [4] Reserved */
      __IO uint32_t WDG_SW   : 1;  /**< [5] User option bytes */
      __IO uint32_t nRST_STOP: 1;  /**< [6] User option bytes */
      __IO uint32_t nRST_STDBY:1;  /**< [7] User option bytes */
      __IO uint32_t RDP      : 8;  /**< [15:8] Read protect */
      __IO uint32_t nWRP     : 12; /**< [27:16] Write protect */
      uint32_t               : 4;  /**< [31:28] Reserved */
    } bit;
  } OPTCR;
} FLASH_TypeDef;

