Lelouch2503/stm32f411xe/inc/stm32f411_xe.h
/* ── PWR (Power Controller) ────────────────────────────────────────── */
typedef struct {
  union {
    __IO uint32_t reg;  /**< 0x00  Power control           */
    struct {
      __IO uint32_t LPDS     : 1;  /**< [0] Low-power deep sleep */
      __IO uint32_t PDDS     : 1;  /**< [1] Power down deep sleep */
      __IO uint32_t CWUF     : 1;  /**< [2] Clear wakeup flag */
      __IO uint32_t CSBF     : 1;  /**< [3] Clear standby flag */
      __IO uint32_t PVDE     : 1;  /**< [4] Power voltage detector enable */
      __IO uint32_t PLS      : 3;  /**< [7:5] PVD level selection */
      __IO uint32_t DBP      : 1;  /**< [8] Disable backup domain write protection */
      __IO uint32_t FPDS     : 1;  /**< [9] Flash power down in Stop mode */
      uint32_t               : 4;  /**< [13:10] Reserved */
      __IO uint32_t VOS      : 2;  /**< [15:14] Regulator voltage scaling output selection */
      uint32_t               : 16; /**< [31:16] Reserved */
    } bit;
  } CR;
  union {
    __IO uint32_t reg; /**< 0x04  Power control/status    */
    struct {
      __I  uint32_t WUF      : 1;  /**< [0] Wakeup flag */
      __I  uint32_t SBF      : 1;  /**< [1] Standby flag */
      __I  uint32_t PVDO     : 1;  /**< [2] PVD output */
      __I  uint32_t BRR      : 1;  /**< [3] Backup regulator ready */
      uint32_t               : 4;  /**< [7:4] Reserved */
      __IO uint32_t EWUP     : 1;  /**< [8] Enable WKUP pin */
      __IO uint32_t BRE      : 1;  /**< [9] Backup regulator enable */
      uint32_t               : 4;  /**< [13:10] Reserved */
      __I  uint32_t VOSRDY   : 1;  /**< [14] Regulator voltage scaling output ready */
      uint32_t               : 17; /**< [31:15] Reserved */
    } bit;
  } CSR;
} PWR_TypeDef;

/* ── GPIO (General Purpose I/O) ────────────────────────────────────── */
typedef struct {
  __IO uint32_t MODER;   /**< 0x00 GPIO port mode register                 */
  __IO uint32_t OTYPER;  /**< 0x04 GPIO port output type register            */
  __IO uint32_t OSPEEDR; /**< 0x08 GPIO port output speed register           */
  __IO uint32_t PUPDR;   /**< 0x0C GPIO port pull-up/pull-down register     */
  __I  uint32_t IDR;     /**< 0x10 GPIO port input data register            */
  __IO uint32_t ODR;     /**< 0x14 GPIO port output data register           */
  __O  uint32_t BSRR;    /**< 0x18 GPIO port bit set/reset register          */
  __IO uint32_t LCKR;    /**< 0x1C GPIO port configuration lock register     */
  __IO uint32_t AFR[2U]; /**< 0x20-0x24 GPIO alternate function registers    */
} GPIO_TypeDef;

/* ── I2C (Inter-integrated Circuit) ────────────────────────────────── */
/* Reference: RM0383 Rev 3, Chapter 18 */
typedef struct {
  __IO uint32_t CR1;   /**< 0x00 Control register 1 */
  __IO uint32_t CR2;   /**< 0x04 Control register 2 */
  __IO uint32_t OAR1;  /**< 0x08 Own address register 1 */
  __IO uint32_t OAR2;  /**< 0x0C Own address register 2 */
  __IO uint32_t DR;    /**< 0x10 Data register */
  __IO uint32_t SR1;   /**< 0x14 Status register 1 */
  __IO uint32_t SR2;   /**< 0x18 Status register 2 */
  __IO uint32_t CCR;   /**< 0x1C Clock control register */
  __IO uint32_t TRISE; /**< 0x20 TRISE register */
  __IO uint32_t FLTR;  /**< 0x24 FLTR register */
} I2C_TypeDef;

/* ── USART (Universal Synchronous/Asynchronous Receiver Transmitter) ── */
/* Reference: RM0383 Rev 3, Chapter 19 */
typedef struct {
  union {
    __IO uint32_t reg;         /**< 0x00 Status register */
    struct {
      __I  uint32_t PE       : 1;  /**< [0] Parity error                    */
      __I  uint32_t FE       : 1;  /**< [1] Framing error                   */
      __I  uint32_t NF       : 1;  /**< [2] Noise detected flag             */
      __I  uint32_t ORE      : 1;  /**< [3] Overrun error                   */
      __I  uint32_t IDLE     : 1;  /**< [4] IDLE line detected              */
      __I  uint32_t RXNE     : 1;  /**< [5] Read data register not empty    */
      __IO uint32_t TC       : 1;  /**< [6] Transmission complete           */
      __I  uint32_t TXE      : 1;  /**< [7] Transmit data register empty    */
      __IO uint32_t LBD      : 1;  /**< [8] LIN break detection flag        */
      __IO uint32_t CTS      : 1;  /**< [9] CTS flag                        */
      uint32_t               : 22; /**< [31:10] Reserved                    */
    } bit;
  } SR;

  union {
    __IO uint32_t reg;         /**< 0x04 Data register */
    struct {
      __IO uint32_t DR       : 9;  /**< [8:0] Data value                    */
      uint32_t               : 23; /**< [31:9] Reserved                     */
    } bit;
  } DR;

  union {
    __IO uint32_t reg;         /**< 0x08 Baud rate register */
    struct {
      __IO uint32_t DIV_Fraction : 4;  /**< [3:0] Fraction of USARTDIV      */
      __IO uint32_t DIV_Mantissa : 12; /**< [15:4] Mantissa of USARTDIV     */
      uint32_t                   : 16; /**< [31:16] Reserved                */
    } bit;
  } BRR;

  union {
    __IO uint32_t reg;         /**< 0x0C Control register 1 */
    struct {
      __IO uint32_t SBK      : 1;  /**< [0] Send break                      */
      __IO uint32_t RWU      : 1;  /**< [1] Receiver wakeup                 */
      __IO uint32_t RE       : 1;  /**< [2] Receiver enable                 */
      __IO uint32_t TE       : 1;  /**< [3] Transmitter enable               */
      __IO uint32_t IDLEIE   : 1;  /**< [4] IDLE interrupt enable            */
      __IO uint32_t RXNEIE   : 1;  /**< [5] RXNE interrupt enable            */
      __IO uint32_t TCIE     : 1;  /**< [6] Transmission complete IE         */
      __IO uint32_t TXEIE    : 1;  /**< [7] TXE interrupt enable             */
      __IO uint32_t PEIE     : 1;  /**< [8] PE interrupt enable              */
      __IO uint32_t PS       : 1;  /**< [9] Parity selection (0=Even,1=Odd)  */
      __IO uint32_t PCE      : 1;  /**< [10] Parity control enable           */
      __IO uint32_t WAKE     : 1;  /**< [11] Wakeup method                  */
      __IO uint32_t M        : 1;  /**< [12] Word length (0=8bit, 1=9bit)   */
      __IO uint32_t UE       : 1;  /**< [13] USART enable                   */
      uint32_t               : 1;  /**< [14] Reserved                       */
      __IO uint32_t OVER8    : 1;  /**< [15] Oversampling mode (0=16x,1=8x) */
      uint32_t               : 16; /**< [31:16] Reserved                    */
    } bit;
  } CR1;

  union {
    __IO uint32_t reg;         /**< 0x10 Control register 2 */
    struct {
      __IO uint32_t ADD      : 4;  /**< [3:0] Address of the USART node     */
      uint32_t               : 1;  /**< [4] Reserved                        */
      __IO uint32_t LBDL     : 1;  /**< [5] LIN break detection length      */
      __IO uint32_t LBDIE    : 1;  /**< [6] LIN break detection IE          */
      uint32_t               : 1;  /**< [7] Reserved                        */
      __IO uint32_t LBCL     : 1;  /**< [8] Last bit clock pulse            */
      __IO uint32_t CPHA     : 1;  /**< [9] Clock phase                     */
      __IO uint32_t CPOL     : 1;  /**< [10] Clock polarity                 */
      __IO uint32_t CLKEN    : 1;  /**< [11] Clock enable                   */
      __IO uint32_t STOP     : 2;  /**< [13:12] STOP bits                   */
      __IO uint32_t LINEN    : 1;  /**< [14] LIN mode enable                */
      uint32_t               : 17; /**< [31:15] Reserved                    */
    } bit;
  } CR2;

  union {
    __IO uint32_t reg;         /**< 0x14 Control register 3 */
    struct {
      __IO uint32_t EIE      : 1;  /**< [0] Error interrupt enable           */
      __IO uint32_t IREN     : 1;  /**< [1] IrDA mode enable                */
      __IO uint32_t IRLP     : 1;  /**< [2] IrDA low-power                  */
      __IO uint32_t HDSEL    : 1;  /**< [3] Half-duplex selection            */
      __IO uint32_t NACK     : 1;  /**< [4] Smartcard NACK enable            */
      __IO uint32_t SCEN     : 1;  /**< [5] Smartcard mode enable            */
      __IO uint32_t DMAR     : 1;  /**< [6] DMA enable receiver              */
      __IO uint32_t DMAT     : 1;  /**< [7] DMA enable transmitter           */
      __IO uint32_t RTSE     : 1;  /**< [8] RTS enable                      */
      __IO uint32_t CTSE     : 1;  /**< [9] CTS enable                      */
      __IO uint32_t CTSIE    : 1;  /**< [10] CTS interrupt enable            */
      __IO uint32_t ONEBIT   : 1;  /**< [11] One sample bit method enable    */
      uint32_t               : 20; /**< [31:12] Reserved                    */
    } bit;
  } CR3;

  union {
    __IO uint32_t reg;         /**< 0x18 Guard time and prescaler register */
    struct {
      __IO uint32_t PSC      : 8;  /**< [7:0] Prescaler value               */
      __IO uint32_t GT       : 8;  /**< [15:8] Guard time value             */
      uint32_t               : 16; /**< [31:16] Reserved                    */
    } bit;
  } GTPR;
} USART_TypeDef;

/* ══════════════════════════════════════════════════════════════════════
 * Peripheral Instance Macros
 * ═════════════════════════════════════════════════════════════════════ */
#define RCC    ((RCC_TypeDef *)RCC_BASE)
#define FLASH  ((FLASH_TypeDef *)FLASH_R_BASE)
#define PWR    ((PWR_TypeDef *)PWR_BASE)

#define GPIOA  ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB  ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC  ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD  ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOE  ((GPIO_TypeDef *)GPIOE_BASE)
#define GPIOH  ((GPIO_TypeDef *)GPIOH_BASE)

#define USART1 ((USART_TypeDef *)USART1_BASE)
#define USART2 ((USART_TypeDef *)USART2_BASE)
#define USART6 ((USART_TypeDef *)USART6_BASE)

#define I2C1 ((I2C_TypeDef *)I2C1_BASE)
#define I2C2 ((I2C_TypeDef *)I2C2_BASE)
#define I2C3 ((I2C_TypeDef *)I2C3_BASE)

/* ══════════════════════════════════════════════════════════════════════
 * RCC Bit Definitions
 * ═════════════════════════════════════════════════════════════════════ */

/* ── RCC_CR ────────────────────────────────────────────────────────── */
#define RCC_CR_HSION_Pos (0U)
#define RCC_CR_HSION (1U << RCC_CR_HSION_Pos)
#define RCC_CR_HSIRDY_Pos (1U)
#define RCC_CR_HSIRDY (1U << RCC_CR_HSIRDY_Pos)
#define RCC_CR_HSEON_Pos (16U)
#define RCC_CR_HSEON (1U << RCC_CR_HSEON_Pos)
#define RCC_CR_HSERDY_Pos (17U)
#define RCC_CR_HSERDY (1U << RCC_CR_HSERDY_Pos)
#define RCC_CR_HSEBYP_Pos (18U)
#define RCC_CR_HSEBYP (1U << RCC_CR_HSEBYP_Pos)
#define RCC_CR_CSSON_Pos (19U)
#define RCC_CR_CSSON (1U << RCC_CR_CSSON_Pos)
#define RCC_CR_PLLON_Pos (24U)
#define RCC_CR_PLLON (1U << RCC_CR_PLLON_Pos)
#define RCC_CR_PLLRDY_Pos (25U)
#define RCC_CR_PLLRDY (1U << RCC_CR_PLLRDY_Pos)
#define RCC_CR_PLLI2SON_Pos (26U)
#define RCC_CR_PLLI2SON (1U << RCC_CR_PLLI2SON_Pos)
#define RCC_CR_PLLI2SRDY_Pos (27U)
#define RCC_CR_PLLI2SRDY (1U << RCC_CR_PLLI2SRDY_Pos)

/* ── RCC_PLLCFGR ──────────────────────────────────────────────────── */
#define RCC_PLLCFGR_PLLM_Pos (0U)
#define RCC_PLLCFGR_PLLM_Msk (0x3FU << RCC_PLLCFGR_PLLM_Pos) /* [5:0]   */
#define RCC_PLLCFGR_PLLN_Pos (6U)
#define RCC_PLLCFGR_PLLN_Msk (0x1FFU << RCC_PLLCFGR_PLLN_Pos) /* [14:6]  */
#define RCC_PLLCFGR_PLLP_Pos (16U)
#define RCC_PLLCFGR_PLLP_Msk (0x3U << RCC_PLLCFGR_PLLP_Pos) /* [17:16] */
#define RCC_PLLCFGR_PLLSRC_Pos (22U)
#define RCC_PLLCFGR_PLLSRC (1U << RCC_PLLCFGR_PLLSRC_Pos)
#define RCC_PLLCFGR_PLLSRC_HSI (0U)
#define RCC_PLLCFGR_PLLSRC_HSE (1U << RCC_PLLCFGR_PLLSRC_Pos)
#define RCC_PLLCFGR_PLLQ_Pos (24U)
#define RCC_PLLCFGR_PLLQ_Msk (0xFU << RCC_PLLCFGR_PLLQ_Pos) /* [27:24] */

/* ── RCC_CFGR ─────────────────────────────────────────────────────── */
#define RCC_CFGR_SW_Pos (0U)
#define RCC_CFGR_SW_Msk (0x3U << RCC_CFGR_SW_Pos) /* [1:0]   */
#define RCC_CFGR_SW_HSI (0x0U << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SW_HSE (0x1U << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SW_PLL (0x2U << RCC_CFGR_SW_Pos)

