Lelouch2503/stm32f411xe/inc/stm32f411_xe.h
#define RCC_CFGR_SWS_Pos (2U)
#define RCC_CFGR_SWS_Msk (0x3U << RCC_CFGR_SWS_Pos) /* [3:2]   */
#define RCC_CFGR_SWS_HSI (0x0U << RCC_CFGR_SWS_Pos)
#define RCC_CFGR_SWS_HSE (0x1U << RCC_CFGR_SWS_Pos)
#define RCC_CFGR_SWS_PLL (0x2U << RCC_CFGR_SWS_Pos)

#define RCC_CFGR_HPRE_Pos (4U)
#define RCC_CFGR_HPRE_Msk (0xFU << RCC_CFGR_HPRE_Pos) /* [7:4]   */

#define RCC_CFGR_PPRE1_Pos (10U)
#define RCC_CFGR_PPRE1_Msk (0x7U << RCC_CFGR_PPRE1_Pos) /* [12:10] */

#define RCC_CFGR_PPRE2_Pos (13U)
#define RCC_CFGR_PPRE2_Msk (0x7U << RCC_CFGR_PPRE2_Pos) /* [15:13] */

/* ── RCC_AHB1ENR ──────────────────────────────────────────────────── */
#define RCC_AHB1ENR_GPIOAEN (1U << 0)
#define RCC_AHB1ENR_GPIOBEN (1U << 1)
#define RCC_AHB1ENR_GPIOCEN (1U << 2)
#define RCC_AHB1ENR_GPIODEN (1U << 3)
#define RCC_AHB1ENR_GPIOEEN (1U << 4)
#define RCC_AHB1ENR_GPIOHEN (1U << 7)
#define RCC_AHB1ENR_CRCEN (1U << 12)
#define RCC_AHB1ENR_DMA1EN (1U << 21)
#define RCC_AHB1ENR_DMA2EN (1U << 22)

/* ── RCC_AHB2ENR ──────────────────────────────────────────────────── */
#define RCC_AHB2ENR_OTGFSEN (1U << 7)

/* ── RCC_APB1ENR ──────────────────────────────────────────────────── */
#define RCC_APB1ENR_TIM2EN (1U << 0)
#define RCC_APB1ENR_TIM3EN (1U << 1)
#define RCC_APB1ENR_TIM4EN (1U << 2)
#define RCC_APB1ENR_TIM5EN (1U << 3)
#define RCC_APB1ENR_WWDGEN (1U << 11)
#define RCC_APB1ENR_SPI2EN (1U << 14)
#define RCC_APB1ENR_SPI3EN (1U << 15)
#define RCC_APB1ENR_USART2EN (1U << 17)
#define RCC_APB1ENR_I2C1EN (1U << 21)
#define RCC_APB1ENR_I2C2EN (1U << 22)
#define RCC_APB1ENR_I2C3EN (1U << 23)
#define RCC_APB1ENR_PWREN (1U << 28)

/* ── RCC_APB2ENR ──────────────────────────────────────────────────── */
#define RCC_APB2ENR_TIM1EN (1U << 0)
#define RCC_APB2ENR_USART1EN (1U << 4)
#define RCC_APB2ENR_USART6EN (1U << 5)
#define RCC_APB2ENR_ADC1EN (1U << 8)
#define RCC_APB2ENR_SDIOEN (1U << 11)
#define RCC_APB2ENR_SPI1EN (1U << 12)
#define RCC_APB2ENR_SPI4EN (1U << 13)
#define RCC_APB2ENR_SYSCFGEN (1U << 14)
#define RCC_APB2ENR_TIM9EN (1U << 16)
#define RCC_APB2ENR_TIM10EN (1U << 17)
#define RCC_APB2ENR_TIM11EN (1U << 18)
#define RCC_APB2ENR_SPI5EN (1U << 20)

/* ── RCC_AHB1RSTR ─────────────────────────────────────────────────── */
#define RCC_AHB1RSTR_GPIOARST (1U << 0)
#define RCC_AHB1RSTR_GPIOBRST (1U << 1)
#define RCC_AHB1RSTR_GPIOCRST (1U << 2)
#define RCC_AHB1RSTR_GPIODRST (1U << 3)
#define RCC_AHB1RSTR_GPIOERST (1U << 4)
#define RCC_AHB1RSTR_GPIOHRST (1U << 7)
#define RCC_AHB1RSTR_CRCRST (1U << 12)
#define RCC_AHB1RSTR_DMA1RST (1U << 21)
#define RCC_AHB1RSTR_DMA2RST (1U << 22)

/* ── RCC_APB1RSTR ─────────────────────────────────────────────────── */
#define RCC_APB1RSTR_TIM2RST (1U << 0)
#define RCC_APB1RSTR_TIM3RST (1U << 1)
#define RCC_APB1RSTR_TIM4RST (1U << 2)
#define RCC_APB1RSTR_TIM5RST (1U << 3)
#define RCC_APB1RSTR_WWDGRST (1U << 11)
#define RCC_APB1RSTR_SPI2RST (1U << 14)
#define RCC_APB1RSTR_SPI3RST (1U << 15)
#define RCC_APB1RSTR_USART2RST (1U << 17)
#define RCC_APB1RSTR_I2C1RST (1U << 21)
#define RCC_APB1RSTR_I2C2RST (1U << 22)
#define RCC_APB1RSTR_I2C3RST (1U << 23)

/* ── I2C register bit definitions ──────────────────────────────────── */
#define I2C_CR1_PE        (1U << 0)
#define I2C_CR1_START     (1U << 8)
#define I2C_CR1_STOP      (1U << 9)
#define I2C_CR1_ACK       (1U << 10)
#define I2C_CR1_POS       (1U << 11)
#define I2C_CR1_SWRST     (1U << 15)

#define I2C_CR2_FREQ_Msk  (0x3FU << 0)

#define I2C_OAR1_ADD0     (1U << 0)
#define I2C_OAR1_ADD7_Msk (0x7FU << 1)
#define I2C_OAR1_ADDMODE  (1U << 15)
#define I2C_OAR1_BIT14    (1U << 14)

#define I2C_SR1_SB        (1U << 0)
#define I2C_SR1_ADDR      (1U << 1)
#define I2C_SR1_BTF       (1U << 2)
#define I2C_SR1_ADD10     (1U << 3)
#define I2C_SR1_STOPF     (1U << 4)
#define I2C_SR1_RXNE      (1U << 6)
#define I2C_SR1_TXE       (1U << 7)
#define I2C_SR1_BERR      (1U << 8)
#define I2C_SR1_ARLO      (1U << 9)
#define I2C_SR1_AF        (1U << 10)
#define I2C_SR1_OVR       (1U << 11)
#define I2C_SR1_TIMEOUT   (1U << 14)

#define I2C_SR2_MSL       (1U << 0)
#define I2C_SR2_BUSY      (1U << 1)
#define I2C_SR2_TRA       (1U << 2)

#define I2C_CCR_CCR_Msk   (0xFFFU << 0)
#define I2C_CCR_DUTY      (1U << 14)
#define I2C_CCR_FS        (1U << 15)

#define I2C_TRISE_TRISE_Msk (0x3FU << 0)
#define RCC_APB1RSTR_PWRRST (1U << 28)

/* ── RCC_APB2RSTR ─────────────────────────────────────────────────── */
#define RCC_APB2RSTR_TIM1RST (1U << 0)
#define RCC_APB2RSTR_USART1RST (1U << 4)
#define RCC_APB2RSTR_USART6RST (1U << 5)
#define RCC_APB2RSTR_ADC1RST (1U << 8)
#define RCC_APB2RSTR_SDIORST (1U << 11)
#define RCC_APB2RSTR_SPI1RST (1U << 12)
#define RCC_APB2RSTR_SPI4RST (1U << 13)
#define RCC_APB2RSTR_SYSCFGRST (1U << 14)
#define RCC_APB2RSTR_TIM9RST (1U << 16)
#define RCC_APB2RSTR_TIM10RST (1U << 17)
#define RCC_APB2RSTR_TIM11RST (1U << 18)
#define RCC_APB2RSTR_SPI5RST (1U << 20)

/* ══════════════════════════════════════════════════════════════════════
 * FLASH Bit Definitions
 * ═════════════════════════════════════════════════════════════════════ */

/* ── FLASH_ACR ─────────────────────────────────────────────────────── */
#define FLASH_ACR_LATENCY_Pos (0U)
#define FLASH_ACR_LATENCY_Msk (0xFU << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_PRFTEN (1U << 8) /**< Prefetch enable        */
#define FLASH_ACR_ICEN (1U << 9)   /**< Instruction cache en   */
#define FLASH_ACR_DCEN (1U << 10)  /**< Data cache enable      */
#define FLASH_ACR_ICRST (1U << 11) /**< Instruction cache rst  */
#define FLASH_ACR_DCRST (1U << 12) /**< Data cache reset       */

/* ══════════════════════════════════════════════════════════════════════
 * PWR Bit Definitions
 * ═════════════════════════════════════════════════════════════════════ */

/* ── PWR_CR ────────────────────────────────────────────────────────── */
#define PWR_CR_VOS_Pos (14U)
#define PWR_CR_VOS_Msk (0x3U << PWR_CR_VOS_Pos)
#define PWR_CR_VOS_SCALE1 (0x3U << PWR_CR_VOS_Pos) /**< Max freq ≤100 MHz */
#define PWR_CR_VOS_SCALE2 (0x2U << PWR_CR_VOS_Pos) /**< Max freq ≤84 MHz  */
#define PWR_CR_VOS_SCALE3 (0x1U << PWR_CR_VOS_Pos) /**< Max freq ≤64 MHz  */

/* ══════════════════════════════════════════════════════════════════════
 * GPIO Bit Definitions
 * ═════════════════════════════════════════════════════════════════════ */

/* ── GPIO_LCKR ─────────────────────────────────────────────────────── */
#define GPIO_LCKR_LCKK_Pos (16U)
#define GPIO_LCKR_LCKK     (1U << GPIO_LCKR_LCKK_Pos)

/* ══════════════════════════════════════════════════════════════════════
 * USART Bit Definitions
 * Reference: RM0383 Rev 3, §19.6
 * ═════════════════════════════════════════════════════════════════════ */

