Lelouch2503/stm32f411xe/inc/stm32f411_xe.h
/* ── USART_SR ──────────────────────────────────────────────────────── */
#define USART_SR_PE_Pos   (0U)
#define USART_SR_PE       (1U << USART_SR_PE_Pos)   /**< Parity error        */
#define USART_SR_FE_Pos   (1U)
#define USART_SR_FE       (1U << USART_SR_FE_Pos)   /**< Framing error       */
#define USART_SR_NF_Pos   (2U)
#define USART_SR_NF       (1U << USART_SR_NF_Pos)   /**< Noise detected      */
#define USART_SR_ORE_Pos  (3U)
#define USART_SR_ORE      (1U << USART_SR_ORE_Pos)  /**< Overrun error       */
#define USART_SR_IDLE_Pos (4U)
#define USART_SR_IDLE     (1U << USART_SR_IDLE_Pos)  /**< IDLE line detected  */
#define USART_SR_RXNE_Pos (5U)
#define USART_SR_RXNE     (1U << USART_SR_RXNE_Pos)  /**< RX not empty        */
#define USART_SR_TC_Pos   (6U)
#define USART_SR_TC       (1U << USART_SR_TC_Pos)   /**< Transmission complete*/
#define USART_SR_TXE_Pos  (7U)
#define USART_SR_TXE      (1U << USART_SR_TXE_Pos)  /**< TX data reg empty   */
#define USART_SR_LBD_Pos  (8U)
#define USART_SR_LBD      (1U << USART_SR_LBD_Pos)  /**< LIN break detected  */
#define USART_SR_CTS_Pos  (9U)
#define USART_SR_CTS      (1U << USART_SR_CTS_Pos)  /**< CTS flag            */

/* ── USART_BRR ─────────────────────────────────────────────────────── */
#define USART_BRR_DIV_Fraction_Pos (0U)
#define USART_BRR_DIV_Fraction_Msk (0xFU << USART_BRR_DIV_Fraction_Pos)
#define USART_BRR_DIV_Mantissa_Pos (4U)
#define USART_BRR_DIV_Mantissa_Msk (0xFFFU << USART_BRR_DIV_Mantissa_Pos)

/* ── USART_CR1 ─────────────────────────────────────────────────────── */
#define USART_CR1_SBK_Pos    (0U)
#define USART_CR1_SBK        (1U << USART_CR1_SBK_Pos)
#define USART_CR1_RWU_Pos    (1U)
#define USART_CR1_RWU        (1U << USART_CR1_RWU_Pos)
#define USART_CR1_RE_Pos     (2U)
#define USART_CR1_RE         (1U << USART_CR1_RE_Pos)
#define USART_CR1_TE_Pos     (3U)
#define USART_CR1_TE         (1U << USART_CR1_TE_Pos)
#define USART_CR1_IDLEIE_Pos (4U)
#define USART_CR1_IDLEIE     (1U << USART_CR1_IDLEIE_Pos)
#define USART_CR1_RXNEIE_Pos (5U)
#define USART_CR1_RXNEIE     (1U << USART_CR1_RXNEIE_Pos)
#define USART_CR1_TCIE_Pos   (6U)
#define USART_CR1_TCIE       (1U << USART_CR1_TCIE_Pos)
#define USART_CR1_TXEIE_Pos  (7U)
#define USART_CR1_TXEIE      (1U << USART_CR1_TXEIE_Pos)
#define USART_CR1_PEIE_Pos   (8U)
#define USART_CR1_PEIE       (1U << USART_CR1_PEIE_Pos)
#define USART_CR1_PS_Pos     (9U)
#define USART_CR1_PS         (1U << USART_CR1_PS_Pos)
#define USART_CR1_PCE_Pos    (10U)
#define USART_CR1_PCE        (1U << USART_CR1_PCE_Pos)
#define USART_CR1_WAKE_Pos   (11U)
#define USART_CR1_WAKE       (1U << USART_CR1_WAKE_Pos)
#define USART_CR1_M_Pos      (12U)
#define USART_CR1_M          (1U << USART_CR1_M_Pos)
#define USART_CR1_UE_Pos     (13U)
#define USART_CR1_UE         (1U << USART_CR1_UE_Pos)
#define USART_CR1_OVER8_Pos  (15U)
#define USART_CR1_OVER8      (1U << USART_CR1_OVER8_Pos)

/* ── USART_CR2 ─────────────────────────────────────────────────────── */
#define USART_CR2_ADD_Pos    (0U)
#define USART_CR2_ADD_Msk    (0xFU << USART_CR2_ADD_Pos)
#define USART_CR2_LBDL_Pos   (5U)
#define USART_CR2_LBDL       (1U << USART_CR2_LBDL_Pos)
#define USART_CR2_LBDIE_Pos  (6U)
#define USART_CR2_LBDIE      (1U << USART_CR2_LBDIE_Pos)
#define USART_CR2_LBCL_Pos   (8U)
#define USART_CR2_LBCL       (1U << USART_CR2_LBCL_Pos)
#define USART_CR2_CPHA_Pos   (9U)
#define USART_CR2_CPHA       (1U << USART_CR2_CPHA_Pos)
#define USART_CR2_CPOL_Pos   (10U)
#define USART_CR2_CPOL       (1U << USART_CR2_CPOL_Pos)
#define USART_CR2_CLKEN_Pos  (11U)
#define USART_CR2_CLKEN      (1U << USART_CR2_CLKEN_Pos)
#define USART_CR2_STOP_Pos   (12U)
#define USART_CR2_STOP_Msk   (0x3U << USART_CR2_STOP_Pos)
#define USART_CR2_LINEN_Pos  (14U)
#define USART_CR2_LINEN      (1U << USART_CR2_LINEN_Pos)

/* ── USART_CR3 ─────────────────────────────────────────────────────── */
#define USART_CR3_EIE_Pos    (0U)
#define USART_CR3_EIE        (1U << USART_CR3_EIE_Pos)
#define USART_CR3_IREN_Pos   (1U)
#define USART_CR3_IREN       (1U << USART_CR3_IREN_Pos)
#define USART_CR3_IRLP_Pos   (2U)
#define USART_CR3_IRLP       (1U << USART_CR3_IRLP_Pos)
#define USART_CR3_HDSEL_Pos  (3U)
#define USART_CR3_HDSEL      (1U << USART_CR3_HDSEL_Pos)
#define USART_CR3_NACK_Pos   (4U)
#define USART_CR3_NACK       (1U << USART_CR3_NACK_Pos)
#define USART_CR3_SCEN_Pos   (5U)
#define USART_CR3_SCEN       (1U << USART_CR3_SCEN_Pos)
#define USART_CR3_DMAR_Pos   (6U)
#define USART_CR3_DMAR       (1U << USART_CR3_DMAR_Pos)
#define USART_CR3_DMAT_Pos   (7U)
#define USART_CR3_DMAT       (1U << USART_CR3_DMAT_Pos)
#define USART_CR3_RTSE_Pos   (8U)
#define USART_CR3_RTSE       (1U << USART_CR3_RTSE_Pos)
#define USART_CR3_CTSE_Pos   (9U)
#define USART_CR3_CTSE       (1U << USART_CR3_CTSE_Pos)
#define USART_CR3_CTSIE_Pos  (10U)
#define USART_CR3_CTSIE      (1U << USART_CR3_CTSIE_Pos)
#define USART_CR3_ONEBIT_Pos (11U)
#define USART_CR3_ONEBIT     (1U << USART_CR3_ONEBIT_Pos)

/* ══════════════════════════════════════════════════════════════════════
 * Cortex-M4 Core — SysTick Timer
 * Reference: ARMv7-M Architecture Reference Manual §B3.3
 * ═════════════════════════════════════════════════════════════════════ */

/* ── Memory Map ────────────────────────────────────────────────────── */
#define SCS_BASE 0xE000E000UL
#define SYSTICK_BASE (SCS_BASE + 0x0010UL)

/* ── Register Structure ────────────────────────────────────────────── */
typedef struct {
  union {
    __IO uint32_t reg;    /**< 0x00  Control and Status register (whole register) */
    struct {
      __IO uint32_t ENABLE    : 1;  /**< [0] Counter enable              */
      __IO uint32_t TICKINT   : 1;  /**< [1] Interrupt on count to 0     */
      __IO uint32_t CLKSOURCE : 1;  /**< [2] 1=AHB clock, 0=AHB/8        */
      uint32_t                : 13; /**< [15:3] Reserved                 */
      __I  uint32_t COUNTFLAG : 1;  /**< [16] 1 if counted to 0          */
      uint32_t                : 15; /**< [31:17] Reserved                */
    } bit;
  } CTRL;
  union {
    __IO uint32_t reg;    /**< 0x04  Reload Value register (whole register) */
    struct {
      __IO uint32_t RELOAD    : 24; /**< [23:0] 24-bit reload value      */
      uint32_t                : 8;  /**< [31:24] Reserved                */
    } bit;
  } LOAD;
  union {
    __IO uint32_t reg;    /**< 0x08  Current Value register (whole register) */
    struct {
      __IO uint32_t CURRENT   : 24; /**< [23:0] 24-bit current value     */
      uint32_t                : 8;  /**< [31:24] Reserved                */
    } bit;
  } VAL;
  union {
    __I  uint32_t reg;    /**< 0x0C  Calibration Value register (whole register) */
    struct {
      __I  uint32_t TENMS     : 24; /**< [23:0] 10ms calibration value   */
      uint32_t                : 6;  /**< [29:24] Reserved                */
      __I  uint32_t SKEW      : 1;  /**< [30] Calibration value is skewed*/
      __I  uint32_t NOREF     : 1;  /**< [31] No reference clock         */
    } bit;
  } CALIB;
} SysTick_TypeDef;

/* ── Instance Macro ────────────────────────────────────────────────── */
#define SYSTICK ((SysTick_TypeDef *)SYSTICK_BASE)

/* ── SysTick_CTRL bit definitions ──────────────────────────────────── */
#define SYSTICK_CTRL_ENABLE_Pos (0U)
#define SYSTICK_CTRL_ENABLE                                                    \
  (1U << SYSTICK_CTRL_ENABLE_Pos) /**< Counter enable              */
#define SYSTICK_CTRL_TICKINT_Pos (1U)
#define SYSTICK_CTRL_TICKINT                                                   \
  (1U << SYSTICK_CTRL_TICKINT_Pos) /**< Interrupt on count to 0     */
#define SYSTICK_CTRL_CLKSOURCE_Pos (2U)
#define SYSTICK_CTRL_CLKSOURCE                                                 \
  (1U << SYSTICK_CTRL_CLKSOURCE_Pos) /**< 1=AHB, 0=AHB/8             */
#define SYSTICK_CTRL_COUNTFLAG_Pos (16U)
#define SYSTICK_CTRL_COUNTFLAG                                                 \
  (1U << SYSTICK_CTRL_COUNTFLAG_Pos) /**< 1 if counted to 0 since read*/

/* ── SysTick_LOAD bit definitions ──────────────────────────────────── */
#define SYSTICK_LOAD_RELOAD_Pos (0U)
#define SYSTICK_LOAD_RELOAD_Msk                                                \
  (0x00FFFFFFU << SYSTICK_LOAD_RELOAD_Pos) /**< 24-bit reload value */

/* ── SysTick_CALIB bit definitions ─────────────────────────────────── */
#define SYSTICK_CALIB_TENMS_Msk 0x00FFFFFFU /**< 10ms calibration value     */
#define SYSTICK_CALIB_SKEW_Pos (30U)
#define SYSTICK_CALIB_SKEW                                                     \
  (1U << SYSTICK_CALIB_SKEW_Pos) /**< TENMS not exactly 10ms     */
#define SYSTICK_CALIB_NOREF_Pos (31U)
#define SYSTICK_CALIB_NOREF                                                    \
  (1U << SYSTICK_CALIB_NOREF_Pos) /**< No external ref clock      */

/* ══════════════════════════════════════════════════════════════════════
 * Cortex-M4 Core — NVIC (Nested Vectored Interrupt Controller)
 * Reference: ARMv7-M Architecture Reference Manual §B3.4
 * ═════════════════════════════════════════════════════════════════════ */

/* ── Memory Map ────────────────────────────────────────────────────── */
#define NVIC_BASE (SCS_BASE + 0x0100UL)

/* ── Register Structure ────────────────────────────────────────────── */
typedef struct {
  __IO uint32_t ISER[8U];               /**< Offset: 0x000 (R/W)  Interrupt Set Enable Register */
        uint32_t RESERVED0[24U];
  __IO uint32_t ICER[8U];               /**< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */
        uint32_t RESERVED1[24U];
  __IO uint32_t ISPR[8U];               /**< Offset: 0x100 (R/W)  Interrupt Set Pending Register */
        uint32_t RESERVED2[24U];
  __IO uint32_t ICPR[8U];               /**< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */
        uint32_t RESERVED3[24U];
  __IO uint32_t IABR[8U];               /**< Offset: 0x200 (R/W)  Interrupt Active Bit Register */
        uint32_t RESERVED4[56U];
  __IO uint8_t  IP[240U];               /**< Offset: 0x300 (R/W)  Interrupt Priority Register (8-bit wide) */
        uint32_t RESERVED5[644U];
  __O  uint32_t STIR;                   /**< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register */
} NVIC_TypeDef;

/* ── Instance Macro ────────────────────────────────────────────────── */
#define NVIC ((NVIC_TypeDef *)NVIC_BASE)

/* ══════════════════════════════════════════════════════════════════════
 * Cortex-M4 Core — System Control Block (SCB)
 * Reference: ARMv7-M Architecture Reference Manual §B3.2
 * ═════════════════════════════════════════════════════════════════════ */

/* ── Memory Map ────────────────────────────────────────────────────── */
#define SCB_BASE (SCS_BASE + 0x0D00UL)

/* ── Register Structure ────────────────────────────────────────────── */
typedef struct {
  __I  uint32_t CPUID;                  /**< Offset: 0x000 (R/ )  CPUID Base Register */
  __IO uint32_t ICSR;                   /**< Offset: 0x004 (R/W)  Interrupt Control and State Register */
  __IO uint32_t VTOR;                   /**< Offset: 0x008 (R/W)  Vector Table Offset Register */
  __IO uint32_t AIRCR;                  /**< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
  __IO uint32_t SCR;                    /**< Offset: 0x010 (R/W)  System Control Register */
  __IO uint32_t CCR;                    /**< Offset: 0x014 (R/W)  Configuration and Control Register */
  __IO uint8_t  SHP[12U];               /**< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
  __IO uint32_t SHCSR;                  /**< Offset: 0x024 (R/W)  System Handler Control and State Register */
  __IO uint32_t CFSR;                   /**< Offset: 0x028 (R/W)  Configurable Fault Status Register */
  __IO uint32_t HFSR;                   /**< Offset: 0x02C (R/W)  HardFault Status Register */
  __IO uint32_t DFSR;                   /**< Offset: 0x030 (R/W)  Debug Fault Status Register */
  __IO uint32_t MMFAR;                  /**< Offset: 0x034 (R/W)  MemManage Fault Address Register */
  __IO uint32_t BFAR;                   /**< Offset: 0x038 (R/W)  BusFault Address Register */
  __IO uint32_t AFSR;                   /**< Offset: 0x03C (R/W)  Auxiliary Fault Status Register */
        uint32_t RESERVED0[18U];        /**< Offset: 0x040 */
  __IO uint32_t CPACR;                  /**< Offset: 0x088 (R/W)  Coprocessor Access Control Register */
} SCB_TypeDef;

/* ── Instance Macro ────────────────────────────────────────────────── */
#define SCB ((SCB_TypeDef *)SCB_BASE)

/* ── SCB_AIRCR bit definitions ─────────────────────────────────────── */
#define SCB_AIRCR_VECTKEY_Pos       (16U)
#define SCB_AIRCR_VECTKEY_Msk       (0xFFFFU << SCB_AIRCR_VECTKEY_Pos)
#define SCB_AIRCR_PRIGROUP_Pos      (8U)
#define SCB_AIRCR_PRIGROUP_Msk      (7U << SCB_AIRCR_PRIGROUP_Pos)

#ifdef __cplusplus
}
#endif

#endif /* STM32F411_XE_H */
